Autodesk.Revit.UI.Events.TaskDialogShowingEventArgs.Message
The message that has been displayed in the dialog box.
Since:
2010

Autodesk.Revit.UI.Events.TaskDialogShowingEventArgs
The event arguments used by the DialogBoxShowing event when a Revit task dialog that prompts the user for some action is shown.
Remarks:
When the application receives this object, a task dialog is about to be displayed in Revit that
requires user interaction. The OverrideResult function can be used to cause the dialog
to be dismissed and return a desired result code.
Since:
2010